{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.21.0", "signature": {"inputs": {"input.1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "24"}, {"size": "24"}, {"size": "24"}, {"size": "3"}]}}}, "outputs": {"160": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "24"}, {"size": "24"}, {"size": "24"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "260"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_20", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_33", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_35", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}}}, {"name": "unknown_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_39", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_44", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_48", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_50", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_54", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_59", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_63", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_65", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_69", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_74", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_78", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_80", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_22", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_84", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_89", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_93", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_95", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_99", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_104", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_108", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "260"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_30", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "24"}, {"size": "24"}, {"size": "24"}, {"size": "3"}]}}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_0", "op": "BatchMatMulV2", "input": ["input_1", "unknown"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_1", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_0", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_3", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_1", "PartitionedCall/onnx_tf_prefix_Constant_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_4", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_6", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Sin_4", "PartitionedCall/onnx_tf_prefix_Constant_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_7", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_6", "unknown_1"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "adj_x": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_8", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_7", "unknown_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_10", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_8", "PartitionedCall/onnx_tf_prefix_Constant_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_11", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_12", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Sin_11", "unknown_3"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_13", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_12", "unknown_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_15", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_13", "PartitionedCall/onnx_tf_prefix_Constant_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_16", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_17", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_Sin_4", "PartitionedCall/onnx_tf_prefix_Sin_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_19", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_17", "PartitionedCall/onnx_tf_prefix_Constant_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_21", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Mul_19", "PartitionedCall/onnx_tf_prefix_Constant_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_22", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_21", "unknown_5"], "attr": {"adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_23", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_22", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_25", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_23", "PartitionedCall/onnx_tf_prefix_Constant_24"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_26", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_27", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Sin_26", "unknown_7"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "adj_x": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_28", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_27", "unknown_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_30", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_28", "PartitionedCall/onnx_tf_prefix_Constant_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_31", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_32", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_19", "PartitionedCall/onnx_tf_prefix_Sin_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_34", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_32", "PartitionedCall/onnx_tf_prefix_Constant_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_36", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Mul_34", "PartitionedCall/onnx_tf_prefix_Constant_35"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_37", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_36", "unknown_9"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "adj_x": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_38", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_37", "unknown_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_40", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_38", "PartitionedCall/onnx_tf_prefix_Constant_39"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_41", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_40"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_42", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Sin_41", "unknown_11"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_43", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_42", "unknown_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_45", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_43", "PartitionedCall/onnx_tf_prefix_Constant_44"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_46", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_45"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_47", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_34", "PartitionedCall/onnx_tf_prefix_Sin_46"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_49", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_47", "PartitionedCall/onnx_tf_prefix_Constant_48"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_51", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Mul_49", "PartitionedCall/onnx_tf_prefix_Constant_50"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_52", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_51", "unknown_13"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_53", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_52", "unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_55", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_53", "PartitionedCall/onnx_tf_prefix_Constant_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_56", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_57", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Sin_56", "unknown_15"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_58", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_57", "unknown_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_60", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_58", "PartitionedCall/onnx_tf_prefix_Constant_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_61", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_60"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_62", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_49", "PartitionedCall/onnx_tf_prefix_Sin_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_64", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_62", "PartitionedCall/onnx_tf_prefix_Constant_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_66", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Mul_64", "PartitionedCall/onnx_tf_prefix_Constant_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_67", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_66", "unknown_17"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_68", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_67", "unknown_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_70", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_68", "PartitionedCall/onnx_tf_prefix_Constant_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_71", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_70"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_72", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Sin_71", "unknown_19"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "adj_x": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_73", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_72", "unknown_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_75", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_73", "PartitionedCall/onnx_tf_prefix_Constant_74"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_76", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_75"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_77", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_64", "PartitionedCall/onnx_tf_prefix_Sin_76"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_79", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_77", "PartitionedCall/onnx_tf_prefix_Constant_78"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_81", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Mul_79", "PartitionedCall/onnx_tf_prefix_Constant_80"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_82", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_81", "unknown_21"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "adj_x": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_83", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_82", "unknown_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_85", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_83", "PartitionedCall/onnx_tf_prefix_Constant_84"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_86", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_85"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_87", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Sin_86", "unknown_23"], "attr": {"adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_88", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_87", "unknown_24"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_90", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_88", "PartitionedCall/onnx_tf_prefix_Constant_89"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_91", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_90"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_92", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_79", "PartitionedCall/onnx_tf_prefix_Sin_91"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_94", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_92", "PartitionedCall/onnx_tf_prefix_Constant_93"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_96", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Mul_94", "PartitionedCall/onnx_tf_prefix_Constant_95"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_97", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_96", "unknown_25"], "attr": {"adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_98", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_97", "unknown_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_100", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_98", "PartitionedCall/onnx_tf_prefix_Constant_99"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_101", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_100"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_102", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Sin_101", "unknown_27"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "adj_x": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_103", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_102", "unknown_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_105", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_103", "PartitionedCall/onnx_tf_prefix_Constant_104"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sin_106", "op": "Sin", "input": ["PartitionedCall/onnx_tf_prefix_Mul_105"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_107", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_94", "PartitionedCall/onnx_tf_prefix_Sin_106"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_109", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Add_107", "PartitionedCall/onnx_tf_prefix_Constant_108"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_110", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Mul_109", "unknown_29"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_111", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_110", "unknown_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_Add_111"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [3, 260], "dtype": "float32"}, {"name": "unknown_0", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_2", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_5", "shape": [], "dtype": "float32"}, {"name": "unknown_1", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_2", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_9", "shape": [], "dtype": "float32"}, {"name": "unknown_3", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_4", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_14", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_18", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_20", "shape": [], "dtype": "float32"}, {"name": "unknown_5", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_6", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_24", "shape": [], "dtype": "float32"}, {"name": "unknown_7", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_8", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_29", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_33", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_35", "shape": [], "dtype": "float32"}, {"name": "unknown_9", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_10", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_39", "shape": [], "dtype": "float32"}, {"name": "unknown_11", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_12", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_44", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_48", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_50", "shape": [], "dtype": "float32"}, {"name": "unknown_13", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_14", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_54", "shape": [], "dtype": "float32"}, {"name": "unknown_15", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_16", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_59", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_63", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_65", "shape": [], "dtype": "float32"}, {"name": "unknown_17", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_18", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_69", "shape": [], "dtype": "float32"}, {"name": "unknown_19", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_20", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_74", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_78", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_80", "shape": [], "dtype": "float32"}, {"name": "unknown_21", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_22", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_84", "shape": [], "dtype": "float32"}, {"name": "unknown_23", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_24", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_89", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_93", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_95", "shape": [], "dtype": "float32"}, {"name": "unknown_25", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_26", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_99", "shape": [], "dtype": "float32"}, {"name": "unknown_27", "shape": [260, 260], "dtype": "float32"}, {"name": "unknown_28", "shape": [260], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_104", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_108", "shape": [], "dtype": "float32"}, {"name": "unknown_29", "shape": [260, 1], "dtype": "float32"}, {"name": "unknown_30", "shape": [1], "dtype": "float32"}]}]}